import json

datas = [
    "2022-03-12  青年崇拜  出席人數: 48",
    "2022-03-19  青年崇拜  出席人數: 46",
    "2022-04-09  青年崇拜  出席人數: 45",
    "2022-04-16  青年崇拜  出席人數: 47",
    "2022-04-23  青年崇拜  出席人數: 43",
    "2022-04-30  青年崇拜  出席人數: 43",
    "2022-05-07  團契美好時光(線上)  出席人數: 37",
    "2022-05-14  青年崇拜(線上)	出席人數: 46",
    "2022-05-21  青年崇拜(線上)  出席人數: 42",
    "2022-05-28  青年崇拜(線上)  出席人數: 53",
    "2022-06-11  團契美好時光(線上)  出席人數: 42",
    "2022-06-18  青年崇拜  出席人數: 44",
    "2022-06-25  青年崇拜  出席人數: 47",
    "2022-07-02  青年崇拜  出席人數: 45",
    "2022-07-23  青年崇拜  出席人數: 47",
    "2022-07-30  青年崇拜  出席人數: 49",
    "2022-08-06  青年崇拜  出席人數: 44",
    "2022-08-13  青年崇拜  出席人數: 39",
    "2022-09-03  團契美好時光  出席人數: 27",
    "2022-09-17  青年崇拜  出席人數: 49",
    "2022-09-24  青年崇拜  出席人數: 60",
    "2022-10-01  青年崇拜  出席人數: 46",
    "2022-10-16  青年崇拜  出席人數: 44",
    "2022-10-22  青年崇拜  出席人數: 55",
    "2022-11-05  青年崇拜  出席人數: 37",
    "2022-11-12  青年崇拜  出席人數: 40",
    "2022-11-19  青年崇拜  出席人數: 46",
    "2022-11-26  團契美好時光  出席人數: 24",
    "2022-12-03  團契美好時光  出席人數: 41",
    "2022-12-17  青年崇拜  出席人數: 37",
    "2023-01-07  青年崇拜  出席人數: 38",
    "2023-01-14  青年崇拜  出席人數: 44"
]

res = []

for data in reversed(datas):
    res.append({
        "isExpanded": False,
		"date": data.split()[0],
		"title": data,
        "field": [
			{
				"key": "聚會內容",
				"value": data.split()[1]
			},
			{
				"key": "講員",
				"value": "NA"
			},
			{
				"key": "出席人數",
				"value": data.split()[-1]
			},
			{
				"key": "出席名單",
				"value": []
			},
			{
				"key": "用餐人數",
				"value": 0
			},
			{
				"key": "用餐名單",
				"value": []
			}
		]
    })

print(res)
with open("weeks.json", "w", encoding='utf8') as outfile:
    json.dump(res, outfile, indent=4, ensure_ascii=False)